#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 6s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "448e2b647a26ade3d72a31091cf3856c" -> "69fddb20b938e7a088d044cb1d819fb8"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "a303848132695df8f36330b8b33333d3" -> "2850a366ea6f693b4f8f9458593a50db"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "02d6eb3ac5425cf8ea156e056712bcec" -> "7b73c0d60d29bc80b6c67b29af989a63"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "f108c2fa6cec46c701427924ccc87793" -> "0ef4cae06aa15ca73a6a1f0beef22ab8"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "db796517f3bb0b39a2cc3f31901dda3f" -> "4234bb04a1cd65b3fc0eb2b5b5c95a94"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "20148e9792af1b47827fb20281a95c85" -> "ea68d4c3156504f280fbf0fd3d040901"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "f2b2953b02fcc285913447083182c871" -> "41f290bc398945ce2ca1a9161683153c"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "89bfddd20f4a1a5b30541a47e0441781" -> "63aaf8413c597e8c2a2c205bc8f5ed6c"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "5319c5d0db60a4869fef9239a636b63e" -> "9c9647f2476e630e268762ed16492124"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "c640664b9a963a74219b53b26648c55b" -> "23a61d97a819513d07194c4da6f2f7f3"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "216ce8f64edac5031e9668b4a66ccfa9" -> "31c7d29473d7ec3fe5088c5dce73c659"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "b11ef3f9e87c280818fe2ad4d2b72f97" -> "dc755fdbe8e75a7bd88f7f7d2891a510"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "a77e2f1e327b7a35241f6319d5164d2c" -> "2c52fb28efbdafb48f765546a088e188"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "c3e8e84623cbfa3e323dd369ceb3aa1e" -> "72851620e47f978ea027990dd4f07f16"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "fa87849bd4a2afa276b3de12b45e7a9d" -> "d0a01dd4510e77b8cc76ccf3dc5604b9"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "9b47fadb013b3074fe85fc02fc7e6dc5" -> "60fe9e62eef47d4b81ee1d0a9ceddda2"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "075110e8918873d25ab7631a0dfbb680" -> "def28bacc2de35d89ef5f089a377029e"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "f0795152ae579154554ea9482c635839" -> "90662d50d08063c989bef144b5c62e2b"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "9942c5a98a48bc9dd9ff1054deab37fb" -> "87e1ff4388d0da90014a71e72cbfacbf"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "5665f585e0bd9cf2b94dfc818a46f8a5" -> "9cb860ea2c8d45fc72a5dd9d80bb02a3"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "8fb308cc40d9c35519eae34f6c0ba3ba" -> "a7888768bb135f90fe096061680c6d9c"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "7a7cd5db74ea8b5cc82ea4bc6e837016" -> "eb7029942bf8df7c571b7de21b3a3a4b"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "3e2f1145f96aadc2f7ea61435b3bf9df" -> "9791d0cc8182481c9302bd2a7f9b023b"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "5379b86439a807143e735c8a194f7d71" -> "f402e36ccac69672b1669c5ccd92d39c"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "444d13d93fe6c0efbe114c88da47042d" -> "b049cac2aeb5940b68fc53a9a4598400"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "1b0e2b2ad5b4eac0780de76487dce626" -> "35004d8fe204f7709ba0777cdf04baf5"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "e9f3cd04f7e1b9441e181a3460c8ed0a" -> "8e37a44d3861a21f38be47d926ec75fc"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "5aca3dd060901f0a79ebf704d181042e" -> "f8923655750a056e231bdf13d857487f"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "57ef1c09b7a28b37a0fd989f8854528d" -> "cc96a7e454f69028aad9ca98935750b6"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "385bed8a5838423a346c41e7179c2c0d" -> "d655d1675ad1c24026bc30c331bb0acb"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "9fd157114eeb391a25af06295ecfc506" -> "099105bd43e505b13dc1a02d0a6a03a1"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "278ae57f62452ed81fc6721e0d88e6bb" -> "577ee142d10e2fa925822013367f3892"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "893c22679d966571943e0ddb0be7abc9" -> "d536affe5ab7945c6f04d123de33f717"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "324bedf7cbf3d5093f6c7598ca31e34a" -> "0647403710dfc8eba973c579c5cb27fd"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "16bb901245d09c940245a5761b59b3dc" -> "cdd105aa4e85db07bf7cc3ddb3be0223"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "a4ec2b466b4f96779a0f7a400f0380da" -> "9b7dc6201b5df076d90dd2423eb0e830"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "afd5ebd1e3a09a7953c95fa0ad4f7319" -> "20eaa2de0dc143e5fd88bc174fed7a45"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "441c11724293d80d1ea0c7043e676a1a" -> "d97572a70184ffc46c13fc54f787bd38"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag               = "5c9c7f8b1fc53597bd60734c1d333ac7" -> "0a976eadc3ec499ef98cf78dc9544215"
        id                 = "lambdas/demo/modify_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "53ca17ff831da09bfbf5b664951a523a" -> "1591fe1c674f09fdad42ebd3bfb92855"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "e9f23b5bac31edb860f59c39cee29111" -> "721d6534e4c13b3c7cc55cc44078079f"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "26f14f9b234e288d318f41e3fcef5c31" -> "da789b2f0913d75de4a9ec96aa40ebed"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "58295533e114045695b529c228f676e9" -> "df654ea6ee29b46f4bd657da59d51cb3"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "502f71e136ad9880dc8fab2b5a8e88a8" -> "6d7fbf267755444ce4ebd48f7665856d"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "8c91a38cac7b064b8893e2ac9a673977" -> "0a09c27bdf617e5d636a352b4a6a7032"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "139LboloGZIVHuVchzwQ/vkG7Cg/HIHFyW1npvtjTOs=" -> "xU/+nQvqkeYYjctdAg5Ab2m4xdTeXF9QZ5S3WGA1fug="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "ML6EqWG2rxLtBdImr5ZDVo6X0AYw5MjQLUToF7qE5Yg=" -> "TD6SxWdTUgr9kLfoSGZiyE5sT0DH+Vmlo0w2Kse6Diw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "67zHgmYfvH62iEQveQ4FNiMh6anJ2dO7EOk/9uFlp08=" -> "AgbeyidsTIv2+6tFvvtewcLu8OV3DmdXzaEdx6bkkyc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "m6Sm/trHPTokAZbsaNL98o8BkdNMi4SaFW0ousWkGx4=" -> "1HmEaLUY70YHARFp5f/qETWfLnhQrILAVzTVw9QnOPc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-12-01T20:44:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "IEf7BhQlp5ZJURsBTAZSia+VgZzKnOq/dGDJv/wqw7Q=" -> "iz2UAKVb/L4xCD2HLsPivyLA9DpnncSXRehJ7y8lqJE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "lfQGN1HA8SBuM5/0f1GlxacsUcR9nrE9Q7dauXQf68o=" -> "vhI/8fZbJcYVbG56UFTUY3G8xrBr6IZuRYgE0/8VkQs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "aPPo6r/T3V9/FTKQ4bBpssUREY86L2lNvcLh2vaERcY=" -> "L0yVPCk/uQ0XEKCYWHt7QWBEop6NTvGyF6SIC3sYafE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "jJvpjkgXJTNU0bgCmBiq1rlnrS31uKYfO2ySmlrCb/8=" -> "aaVtNf8uzmCZNB98xelgF/smCMRSAahjNVbh0ZNcgYc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "P5FTQJyXBsnn1RigT8yifv4l3uLlrV8X5Tz0ie12lnU=" -> "ilwENpvgDNSu5JN03rHqOKkSLna86YK94DUNpsnfdwQ="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "zr//wfz2is3iXnef+E7KtjlGAnDH0I4mrVc0Mr0Pz44=" -> "FWobOH6T/gkw+6E+KdcX3UvuU3g0ONSURZ/+RGXREZc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-12-01T20:44:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "tLhp1pk4T2bqIVHq8wLZjcuPs2KYBBu5011StIGaFNw=" -> "r0PZxhpnHauPBer8p+peEtPFR9u4RjXUHKSW38tP89c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-12-01T20:44:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "DPEusTxBYm0/sMQw0KfiIsx0c4imieq1rM9K05/oxeE=" -> "GB2EE/2YaUkF33P99T2lXsrllAlfXVXfDVT4aAU2wUk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "CqORXONbeW3ycINK+iNoc4IznMi+6Tf25Egzq1e7DhA=" -> "asKYeXxcQbVKvxsSM0ZJozLh5+sbP7bne8c0hFcwYqg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "09m1b2MgFJ06KyzIaC/LmXz4R1RUyVNz5Az6+YmvMD0=" -> "hZvdb6F6NMS/ZW6Po9qNOLkZDOgMlZjS2llREnVf7dg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "dNlz6CLNBj4gS8yXo0Zp/V8QWFWuHA1vCMX0YxPq8nE=" -> "yyPX3JwWRGRfZeHdJxlvA+7kdCXN/fgHa8TgYow3RUs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "5/IBKXBBRvdoZYAz6qsApHd+rpjsE2CBp1/pkGeXV08=" -> "V7PnCWIrpTEqUjLz5eEFxWUqWs7W+3rGgEY2dAgRabA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "W2BPFimgPcle6FU9piAWlARV/kB8XhWdBZKxoJTKDQ0=" -> "nSBFLgTeiklnlWQzdvmiNexSuZ5eStjMzSDBkHYJY0c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "cG+mqEUu2q8wwwQyGogKykhltuIKB6C7Jy8F9RC920Q=" -> "xqcbe5tcnC2Mhx3SqwU+mnPBtBaIa1iiqPBrV8xcH10="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "gcMH3+M5w4O3idQwNBQPB9+p19rNlg/HfN1hphCtLxE=" -> "ededpki8zYkBu9YaGSgVG72D86WqDeTRO2iuyrnvq98="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "l+ShIYZtn/2ejoLfnf0rsaVKkv73RyPqKrIZzvEgY+I=" -> "2uvLcdgAgOefZtA6K6u96569pqvyQjIaExEU5o3CwMY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "JfSwym73YkpyU+AfYIfL8Ann7Tqt9+J9Gdt+D1DMB58=" -> "hR/FPgGII9aCvVBk/LO+vUpdad1iWOFmj90h8U5Z6wM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "KhueoGP5CCuPCfGgq5NbG75L6SSQJQBYMbDYxpz2DYo=" -> "odhIg4YyRp8NPl9kjsYR8LbLF48ZalIY5Ufoy6uNVG8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "AlPJbff1K7EbLU5KNqGWrhvrxaishY0ovU4P8gilIzE=" -> "UKNBdKZ977Mzwv/VofYlSnLR2b/Y6j5jm9Nwo3yo/n0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "0uVXlnBNH9V6c/Nfq5n/IOgDbatcIZJ7kmJmx8uJL88=" -> "bU1/gbCEDNleJ/2qC3t0ToNck9TFDsmdUhuV68TMn4E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "P4aSC7lz0pevAFGp+uDQrg1d0FLCMJd8pfMSk6L7hPw=" -> "V7LXllUxBcCuf3x8ba0igaX3HmrefVMb4Ya9z36FcWk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "lIA58UYcQn3O8Oo8MDT4IRj0J2iv9t5Nb64nRYGkUCc=" -> "B9OdJsZMiYe1VACiPS1GPyv3dWGt3QT8xnXXXCf2zSU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "m2F33mFFz+rnPyL0GUVcf3CLIlf5U6WuumbMzF8WSVE=" -> "lq7Z88vh1nii0/hF09ahTf9ysM+bkWkVsoMQ4+CxcT8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "m7cNqzKhzJHNg8th9wSOhhWEYcwxql30Z3yaGoYT2fE=" -> "Vj9A3S0QxeqTmIZG1IibfRmWGUAS0izdtJoefd47Ml0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "JCLWpKM50/XQIkwmJG67GX8qCFLO93MPZ3gv7gEZ9+o=" -> "Y7PdqaJCDoO8Axihns92CvGTJy7Q4gl4vST2n8Az/OM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "KV6SrIKJcwn+nHU+5Kzp9QXS6CqLHv7qmYvWfF0FO5g=" -> "7cMc6YJXzm+MJnHikCgcq1itzmqXXo+w/mDeneyI+1k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "ITztasm036d3VV06ltFmWdYvblyOhHkqvFLbtCtqAlY=" -> "yoXQtztFVXqjzoW4/cOVaAyXW+iwGGIROqyYr1UnuQQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "wIP4kTfwVDRrNHNW4wj3Vx8Zc9//6EvtvflAqdeN8DI=" -> "MohYfi0ftAJBvpwuDBvF+5kkijTCuwbh+nANDfi8/kU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-12-02T19:07:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "sbqHY0DPa/Yx4QVe1PG7lakx2T+Z3aCbV3F7Ugysd5A=" -> "sBGCucedzbsaNbnz3AT+6IqrvDHCnisGgOCCwLZ2DkA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "1xCNRGYbXMEH1mdBQx4KZensBQguD9hKLBtbZW7TxhI=" -> "dRhTW07YwYUNmBtyK8zvAbOpxaspwKGZ3einKr9ra6o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "/X2VytJJzg8zrOizLFYwO8Kj/ysH2n5cw/UVD/yvV/4=" -> "9r2fYtsw71nMO5ZxUA4atzwy5z2QXfdZlMvLs2iSHP8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "4JyzSCc+mGbhwOcG6cR2ZrMbGumVY4/zrU0SRrRekMo=" -> "9QxeEsqDwcVMgwrzFoRW87590a9nf26jNZsB5Nc+CSk="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-12-01T20:44:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "IS7mtRwixMpOHzGLQG3JmZgzp9W2oQI7XE12vNGJJO0=" -> "cyCDOhVGSfIUV4GVGJzwDXuIcoIqOKwbdf60cAwa+Jk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "fnbY8OKAQ+1TPqKOMBjYKMPdyOHwbiGsdYCtUPNUeGE=" -> "UGrj9vMBRdoFgdtGej1rEvlLW9XO7Jf9k9PAiRA3vDM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-12-01T20:44:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "mVwhIm3LJvBJov1DsMbbqAbw4riYpXnwQoF0w9S/YsU=" -> "1Kn8vLfaQR5P0YG9Ox0sg4wPbuGZk8gOG5e2INFxqHc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "XTPkPzJ+6I9zundN0EaQgRyOPzFqwnsbiNo5BU4HLfU=" -> "HfAEj9LuJSqc7qXWHlElpxqn3Bn4sY8NpZESsJ56a5s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "8cFh9AJP5uaeZbuTFpDuZf14n7/xwNi31VszDQ4tFAU=" -> "WXRgFkXNdTFIUADbxAnOx4G79LywjTGkHgX2GAC+mXc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "H//1MavS3AHgUga7zWzYcRDNHkYPMT6wpPMqtCr6juM=" -> "5WmJjRglhdLhMhKfL5axDc8H+02jvm0WX8oVoG9LtsQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-12-01T20:44:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "3xn9F4gqdaGcauXSbxc09PF28UItfgdwSGuJsUn88RY=" -> "iQuWPozU8or/rM4cPUC+k0z5jxcwPDczQdvoKqlAu60="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "AlXkcwdp2UzQi6AqvK94ux1/4TiS1yu+ZE4s/tpjF7o=" -> "4CkPKGhI0Lo8MIViTArJXji8LE9KdwcLJCfGI4d003k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-12-01T20:43:20Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "7h2ws0" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-12-01T20:43:19Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-12-01T20:43:20Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 91 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*